### portpg: stocks
### stock:  price

### Restart & Run All Cells

In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine1 = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine1.connect()

engine2 = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine2.connect()

pd.set_option('display.float_format','{:,.2f}'.format)

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"

today = date.today()
week_str = today.strftime('%Y-%U')
today, week_str

(datetime.date(2022, 11, 19), '2022-46')

In [2]:
sql = '''
SELECT name, market
FROM stocks
'''
stocks_lite = pd.read_sql(sql, conlite)
stocks_lite

     name  market
0     MCS     SET
1   PTTGC   SET50
2   JASIF     SET
3     DIF     SET
4   WHAIR     SET
..    ...     ...
61  SABUY     SET
62     SC     SET
63    TFG     SET
64   COM7  SET100
65    KSL     SET

[66 rows x 2 columns]

In [3]:
sql = '''
SELECT name, market, id
FROM stocks
'''
stocks_pg = pd.read_sql(sql, conpg)
stocks_pg

      name                                 market   id
0      BBL  SET50 / SETCLMV / SETHD / SETTHSI      740
1      BCH   SET100 / SETCLMV / SETHD / SETWB      741
2      BCP         SET100 / SETCLMV / SETTHSI      742
3      BAY                                SET      739
4    CPALL            SET50 / SETTHSI / SETWB      767
..     ...                                    ...  ...
228    SCB          SET50 / SETCLMV / SETTHSI      949
229    SKR                                SET      889
230    SSP                     sSET / SETCLMV      897
231     TU    SET50 / SETCLMV / SETHD / SETWB      936
232  WHART                                SET      945

[233 rows x 3 columns]

In [4]:
df_merge = pd.merge(stocks_lite, stocks_pg, on='name', how='inner')
df_merge

     name market_x                       market_y   id
0     MCS      SET                       sSET      842
1   PTTGC    SET50  SET50 / SETCLMV / SETTHSI      866
2   JASIF      SET                        SET      814
3     DIF      SET                        SET      777
4   WHAIR      SET                        SET      802
..    ...      ...                            ...  ...
61  SABUY      SET                        SET      954
62     SC      SET             sSET / SETTHSI      878
63    TFG      SET                        SET      910
64   COM7   SET100   SET100 / SETTHSI / SETWB      765
65    KSL      SET             sSET / SETCLMV      823

[66 rows x 4 columns]

In [5]:
set50 = df_merge.market_y.str.contains('SET50')
filter_50 = df_merge[set50].copy()
filter_50['market_x'] = 'SET50'
filter_50.sort_values(by=['name'],ascending=[True])

     name market_x                               market_y   id
25  BANPU    SET50          SET50 / SETCLMV / SETTHSI      738
46    BBL    SET50  SET50 / SETCLMV / SETHD / SETTHSI      740
47    BEM    SET50            SET50 / SETTHSI / SETWB      748
23     BH    SET50            SET50 / SETCLMV / SETWB      752
49  CPALL    SET50            SET50 / SETTHSI / SETWB      767
50    CPN    SET50                    SET50 / SETTHSI      769
41    CRC    SET50  SET50 / SETCLMV / SETTHSI / SETWB      773
51     EA    SET50                    SET50 / SETTHSI      781
53  HMPRO    SET50            SET50 / SETTHSI / SETWB      801
24    IVL    SET50                    SET50 / SETTHSI      813
34  JMART    SET50                              SET50      815
35    JMT    SET50                              SET50      816
12    KCE    SET50                              SET50      819
57    KTB    SET50            SET50 / SETHD / SETTHSI      824
58     LH    SET50                      SET50 / SETHD      829
28  PTTEP    SET50  SET50 / SETCLMV / SETHD / SETTHSI      865
1   PTTGC    SET50          SET50 / SETCLMV / SETTHSI      866
43    SCB    SET50          SET50 / SETCLMV / SETTHSI      949
6     SCC    SET50  SET50 / SETCLMV / SETHD / SETTHSI      879
27    TTB    SET50            SET50 / SETHD / SETTHSI      933

In [6]:
set100 = df_merge.market_y.str.contains('SET100')
filter_100 = df_merge[set100].copy()
filter_100['market_x'] = 'SET100'
filter_100.sort_values(by=['name'],ascending=[True])

      name market_x                                market_y   id
29   AMATA   SET100          SET100 / SETCLMV / SETTHSI      727
9      BCH   SET100    SET100 / SETCLMV / SETHD / SETWB      741
30     BCP   SET100          SET100 / SETCLMV / SETTHSI      742
31     CKP   SET100          SET100 / SETCLMV / SETTHSI      764
64    COM7   SET100            SET100 / SETTHSI / SETWB      765
10  DOHOME   SET100                      SET100 / SETWB      778
56     KKP   SET100  SET100 / SETCLMV / SETHD / SETTHSI      822
20     ORI   SET100            SET100 / SETHD / SETTHSI      851
60      QH   SET100                      SET100 / SETHD      867
14     RCL   SET100            SET100 / SETCLMV / SETWB      870
11  SINGER   SET100                      SET100 / SETWB      885
38   SPALI   SET100                      SET100 / SETHD      892
5      STA   SET100            SET100 / SETTHSI / SETWB      898
44   STARK   SET100                              SET100      900
8    SYNEX   SET100                    SET100 / SETTHSI      906

In [7]:
setmai = df_merge.market_y.str.contains('mai')
filter_mai = df_merge[setmai].copy()
filter_mai['market_x'] = 'mai'
filter_mai.sort_values(by=['name'],ascending=[True])

Empty DataFrame
Columns: [name, market_x, market_y, id]
Index: []

In [8]:
filter_set = df_merge[~(set100 | set50 | setmai)].copy()
filter_set['market_x'] = 'SET'
filter_set.sort_values(by=['name'],ascending=[True])

       name market_x                    market_y   id
45      AIT      SET                    sSET      724
22      ASK      SET                     SET      732
16      ASP      SET                    sSET      733
48      BPP      SET       SETCLMV / SETTHSI      757
33  CPNREIT      SET                     SET      771
21      DCC      SET                     SET      774
3       DIF      SET                     SET      777
52     GFPT      SET  sSET / SETTHSI / SETWB      791
32   GVREIT      SET                     SET      798
54     ICHI      SET          sSET / SETCLMV      804
55      III      SET                    sSET      953
2     JASIF      SET                     SET      814
65      KSL      SET          sSET / SETCLMV      823
18    MAKRO      SET                     SET      839
0       MCS      SET                    sSET      842
7       NER      SET                    sSET      847
42    OISHI      SET                     SET      849
59      PSH      SET                 SETTHSI      860
36      PTL      SET                     SET      863
61    SABUY      SET                     SET      954
37    SAPPE      SET                    sSET      875
62       SC      SET          sSET / SETTHSI      878
17     SCCC      SET       SETCLMV / SETTHSI      880
19     SENA      SET                    sSET      882
26      SSP      SET          sSET / SETCLMV      897
39      SVI      SET                     SET      905
40    TFFIF      SET                     SET      909
63      TFG      SET                     SET      910
13      TMT      SET          sSET / SETTHSI      921
4     WHAIR      SET                     SET      802
15    WHART      SET                     SET      945

In [9]:
filter_all = pd.concat([filter_50, filter_100, filter_mai, filter_set], axis=0)
type(filter_all)

pandas.core.frame.DataFrame

In [10]:
filter_all.to_sql('filter_all', engine1, if_exists='replace')

In [11]:
sql = '''
UPDATE stocks
  SET
    market = (SELECT filter_all.market_x FROM filter_all WHERE filter_all.name = stocks.name)
'''
rp = conlite.execute(sql)
rp.rowcount

66